-- Task N8
-- Список студенток с ФТМИ со средним баллом больше 4 старше 25 получивших диплом с 2007-2010
SELECT
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ПОЛ
FROM
    Н_ЛЮДИ
    JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
WHERE
    Н_УЧЕНИКИ.ПРИЗНАК = 'диплом'
    AND Н_ЛЮДИ.ПОЛ = 'Ж'
    AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ ILIKE 'КТиУ'
    AND СОСТОЯНИЕ = 'утвержден'
    AND date_part ('year', Н_УЧЕНИКИ.КОНЕЦ) BETWEEN 2007 AND 2010;
 